FilesystemAndDisk_Test/FS_Disk_SSD_p4800x_NVMe_scripts/P4800x_fs_fio_test_write_ranseq/seq_write_block_8M_2_16_jobs.out
seq_write_test: (g=0): rw=write, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 16 processes

seq_write_test: (groupid=0, jobs=16): err= 0: pid=310809: Sat May 11 12:48:53 2024
  write: IOPS=288, BW=2308MiB/s (2420MB/s)(200GiB/88729msec); 0 zone resets
    slat (usec): min=643, max=2303, avg=1329.21, stdev=156.13
    clat (msec): min=2, max=192, avg=43.79, stdev=38.91
     lat (msec): min=3, max=193, avg=45.12, stdev=39.00
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[    8], 10.00th=[   13], 20.00th=[   17],
     | 30.00th=[   24], 40.00th=[   26], 50.00th=[   32], 60.00th=[   44],
     | 70.00th=[   46], 80.00th=[   51], 90.00th=[  104], 95.00th=[  155],
     | 99.00th=[  161], 99.50th=[  176], 99.90th=[  192], 99.95th=[  192],
     | 99.99th=[  192]
   bw (  MiB/s): min=  863, max= 9810, per=100.00%, avg=2936.99, stdev=143.27, samples=2301
   iops        : min=   98, max= 1224, avg=361.40, stdev=17.98, samples=2301
  lat (msec)   : 4=0.36%, 10=7.80%, 20=18.06%, 50=53.77%, 100=9.90%
  lat (msec)   : 250=10.11%
  cpu          : usr=1.18%, sys=1.83%, ctx=25977, majf=0, minf=243
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,25600,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2308MiB/s (2420MB/s), 2308MiB/s-2308MiB/s (2420MB/s-2420MB/s), io=200GiB (215GB), run=88729-88729msec

Disk stats (read/write):
  nvme5n1: ios=0/1661826, merge=0/18, ticks=0/58593732, in_queue=58593732, util=100.00%

Test Time: 2024-05-11 12:48:53
Device Name: filetest.txt
Device Info: